README.org
#+STARTUP: overview
#+AUTHOR: n-critser
#+TITLE: README.org for project-267
#+DATE: 2014-02-04

* Abstract
  My goal is to create an talking entity using the Arduino Uno rev3 and 
some speakers all contained within an anthropomorphic representation. 
I aim to create a cool project for 267 class that forces me to learn the inner 
workings of the atmega328 microcontroller.  This may include learning the 
low level assembly instructions used by the processor itself, but is not 
limited to this level of programming.

   I will be using a c-library which pushes phoneme simulations and the
code necessary to interact with the serial read and write registers of 
the dedicated speech board.  

   For simulated lip movement I will use 4-3x3 matrix blocks which will
react to the serial output pushed to the speech module.    

* Components
** Speakers
** Arduino Uno - 2 boards (1 for speech , 1 for everything else)
** Battery pack/ ON-Off
** 4-3*3 led matrices for simulated lip movement
** shift registers
* TASKS
** DONE 1st iteration Makefile 
   DEADLINE: <2014-02-04 Tue>
** TODO Chris Kuethe tutorial seperate dir
** TODO Serial input from keyboard
   DEADLINE: <2014-02-12 Wed>
** TODO Serial 2 way commune
** TODO Text to speach testing for arduino
   DEADLINE: <2014-02-12 Wed>
** TODO ?   Using a SD card for storage
   DEADLINE: <2014-02-14 Fri>
** TODO Using libraries in C
   DEADLINE: <2014-02-07 Fri>
** TODO Accessing storage in C
   DEADLINE: <2014-02-09 Sun>
** TODO Parts list for "project"
   DEADLINE: <2014-02-09 Sun>

* SERIAL 
** Output
-this does get the output from the serial port 
cat /dev/ttyACM0 
** Input
haven't tested yet
echo run > /dev/ttyACM0 # supposed to get serial output from Computer

* Compile-Pipeline

