WRITE_UPS/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>README.org for project-267</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-02-04"/>
<meta name="author" content="n-critser"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">README.org for project-267</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Abstract </a></li>
<li><a href="#sec-2">2 Components </a>
<ul>
<li><a href="#sec-2.1">2.1 Speakers </a></li>
<li><a href="#sec-2.2">2.2 Arduino Uno - 2 boards (1 for speech , 1 for everything else) </a></li>
<li><a href="#sec-2.3">2.3 Battery pack/ ON-Off </a></li>
<li><a href="#sec-2.4">2.4 4-3*3 led matrices for simulated lip movement </a></li>
<li><a href="#sec-2.5">2.5 shift registers </a></li>
</ul>
</li>
<li><a href="#sec-3">3 TASKS </a>
<ul>
<li><a href="#sec-3.1">3.1 1st iteration Makefile </a></li>
<li><a href="#sec-3.2">3.2 Chris Kuethe tutorial seperate dir </a></li>
<li><a href="#sec-3.3">3.3 Serial input from keyboard </a></li>
<li><a href="#sec-3.4">3.4 Serial 2 way commune </a></li>
<li><a href="#sec-3.5">3.5 Text to speach testing for arduino </a></li>
<li><a href="#sec-3.6">3.6 ?   Using a SD card for storage </a></li>
<li><a href="#sec-3.7">3.7 Using libraries in C </a></li>
<li><a href="#sec-3.8">3.8 Accessing storage in C </a></li>
<li><a href="#sec-3.9">3.9 Parts list for "project" </a></li>
</ul>
</li>
<li><a href="#sec-4">4 SERIAL </a>
<ul>
<li><a href="#sec-4.1">4.1 Output </a></li>
<li><a href="#sec-4.2">4.2 Input </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Compile-Pipeline </a>
<ul>
<li><a href="#sec-5.1">5.1 Command Line build-&amp;-upload </a>
<ul>
<li><a href="#sec-5.1.1">5.1.1 Example: </a></li>
</ul>
</li>
<li><a href="#sec-5.2">5.2 Makefile build-&amp;-upload </a></li>
</ul>
</li>
<li><a href="#sec-6">6 Bugs-&amp;-Fixes </a>
<ul>
<li><a href="#sec-6.1">6.1 1 </a></li>
<li><a href="#sec-6.2">6.2 2 </a>
<ul>
<li><a href="#sec-6.2.1">6.2.1 ERROR: warning: #warning "F<sub>CPU</sub> not defined for &lt;util/delay.h&gt;" [-Wcpp] </a></li>
<li><a href="#sec-6.2.2">6.2.2 FIX:  put the define in FILE.c itself. </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7">7 c-arduino basics </a></li>
<li><a href="#sec-8">8 Tool-Chain </a>
<ul>
<li><a href="#sec-8.1">8.1 sudo apt-get install make avr-libc avrdude binutils-avr gcc-avr gdb-avr </a></li>
</ul>
</li>
<li><a href="#sec-9">9 Tutorials </a>
<ul>
<li><a href="#sec-9.1">9.1 German robot course </a></li>
<li><a href="#sec-9.2">9.2 Amercan<sub>Tutorials</sub> </a>
<ul>
<li><a href="#sec-9.2.1">9.2.1 Chris Kuethe&ndash;https://www.mainframe.cx/~ckuethe/avr-c-tutorial/ </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-10">10 Arduino-Uno </a></li>
<li><a href="#sec-11">11 AVR-info </a></li>
<li><a href="#sec-12">12 Links </a></li>
<li><a href="#sec-13">13 AtmEGA328-datasheet++ </a>
<ul>
<li><a href="#sec-13.1">13.1 Pins &amp; Ports </a>
<ul>
<li><a href="#sec-13.1.1">13.1.1 Ports </a></li>
</ul>
</li>
<li><a href="#sec-13.2">13.2 Qtouch capacitive touch sensing </a></li>
<li><a href="#sec-13.3">13.3 Program on the fly SPI </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Abstract </h2>
<div class="outline-text-2" id="text-1">

<p>My goal is to create an talking entity using the Arduino Uno rev3 and 
some speakers all contained within an anthropomorphic representation. 
I aim to create a cool project for 267 class that forces me to learn the inner 
workings of the atmega328 microcontroller.  This may include learning the 
low level assembly instructions used by the processor itself, but is not 
limited to this level of programming.
</p>
<p>
I will be using a c-library which pushes phoneme simulations and the
code necessary to interact with the serial read and write registers of 
the dedicated speech board.  
</p>
<p>
For simulated lip movement I will use 4-3x3 matrix blocks which will
react to the serial output pushed to the speech module.    
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Components </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Speakers </h3>
<div class="outline-text-3" id="text-2.1">

</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Arduino Uno - 2 boards (1 for speech , 1 for everything else) </h3>
<div class="outline-text-3" id="text-2.2">

</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> Battery pack/ ON-Off </h3>
<div class="outline-text-3" id="text-2.3">

</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> 4-3*3 led matrices for simulated lip movement </h3>
<div class="outline-text-3" id="text-2.4">

</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5"><span class="section-number-3">2.5</span> shift registers </h3>
<div class="outline-text-3" id="text-2.5">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> TASKS </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> <span class="done DONE"> DONE</span> 1st iteration Makefile </h3>
<div class="outline-text-3" id="text-3.1">

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-02-04 Tue</span></span><br/>
</p></div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> <span class="todo TODO"> TODO</span> Chris Kuethe tutorial seperate dir </h3>
<div class="outline-text-3" id="text-3.2">

</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3"><span class="section-number-3">3.3</span> <span class="todo TODO"> TODO</span> Serial input from keyboard </h3>
<div class="outline-text-3" id="text-3.3">

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-02-12 Wed</span></span><br/>
</p></div>

</div>

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4"><span class="section-number-3">3.4</span> <span class="todo TODO"> TODO</span> Serial 2 way commune </h3>
<div class="outline-text-3" id="text-3.4">

</div>

</div>

<div id="outline-container-3.5" class="outline-3">
<h3 id="sec-3.5"><span class="section-number-3">3.5</span> <span class="todo TODO"> TODO</span> Text to speach testing for arduino </h3>
<div class="outline-text-3" id="text-3.5">

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-02-12 Wed</span></span><br/>
</p></div>

</div>

<div id="outline-container-3.6" class="outline-3">
<h3 id="sec-3.6"><span class="section-number-3">3.6</span> <span class="todo TODO"> TODO</span> ?   Using a SD card for storage </h3>
<div class="outline-text-3" id="text-3.6">

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-02-14 Fri</span></span><br/>
</p></div>

</div>

<div id="outline-container-3.7" class="outline-3">
<h3 id="sec-3.7"><span class="section-number-3">3.7</span> <span class="todo TODO"> TODO</span> Using libraries in C </h3>
<div class="outline-text-3" id="text-3.7">

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-02-07 Fri</span></span><br/>
</p></div>

</div>

<div id="outline-container-3.8" class="outline-3">
<h3 id="sec-3.8"><span class="section-number-3">3.8</span> <span class="todo TODO"> TODO</span> Accessing storage in C </h3>
<div class="outline-text-3" id="text-3.8">

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-02-09 Sun</span></span><br/>
</p></div>

</div>

<div id="outline-container-3.9" class="outline-3">
<h3 id="sec-3.9"><span class="section-number-3">3.9</span> <span class="todo TODO"> TODO</span> Parts list for "project" </h3>
<div class="outline-text-3" id="text-3.9">

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-02-09 Sun</span></span><br/>
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> SERIAL </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1"><span class="section-number-3">4.1</span> Output </h3>
<div class="outline-text-3" id="text-4.1">

<p>-this does get the output from the serial port 
cat /dev/ttyACM0 
</p></div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2"><span class="section-number-3">4.2</span> Input </h3>
<div class="outline-text-3" id="text-4.2">

<p>haven't tested yet
echo run &gt; /dev/ttyACM0 # supposed to get serial output from Computer
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Compile-Pipeline </h2>
<div class="outline-text-2" id="text-5">



</div>
