WRITE_UPS/README.html

<div id="outline-container-5.1" class="outline-3">
<h3 id="sec-5.1"><span class="section-number-3">5.1</span> Command Line build-&amp;-upload </h3>
<div class="outline-text-3" id="text-5.1">

<p>Compile C-code:
$ avr-gcc -Os -DF<sub>CPU</sub>=16000000UL -mmcu=atmega328p -c -o &lt;c<sub>file</sub><sub>name&gt</sub>;.o &lt;c<sub>file</sub><sub>name&gt</sub>;.c
</p>
<p>
Object.o to Executable: 
$  avr-gcc -mmcu=atmega328p &lt;c<sub>file</sub><sub>name&gt</sub>;.o -o &lt;executable<sub>name&gt</sub>;
</p>
<p>
ObjectCopy to Hex:
$  avr-objcopy -O ihex -R .eeprom &lt;executable<sub>name&gt</sub>; &lt;executable<sub>name&gt</sub>;.hex
</p>

<p>
Upload to Board:
*You might have to run this as super user!! BE AWARE * 
$ sudo avrdude -F -V -c arduino -p ATMEGA328P -P /dev/ttyACM0 -b 115200 -U flash:w:&lt;executable<sub>name&gt</sub>;.hex
</p>

</div>

<div id="outline-container-5.1.1" class="outline-4">
<h4 id="sec-5.1.1"><span class="section-number-4">5.1.1</span> Example: </h4>
<div class="outline-text-4" id="text-5.1.1">

<p>$ avr-gcc -mmcu=atmega328p blink<sub>led</sub>.o -o blink<sub>led</sub>
$ avr-objcopy -O ihex -R .eeprom blink<sub>led</sub> blink<sub>led</sub>.hex
$ sudo avrdude -F -V -c arduino -p ATMEGA328P -P /dev/ttyACM0 -b 115200 -U flash:w:blink<sub>led</sub>.hex
</p>
</div>
</div>

</div>

<div id="outline-container-5.2" class="outline-3">
<h3 id="sec-5.2"><span class="section-number-3">5.2</span> Makefile build-&amp;-upload </h3>
<div class="outline-text-3" id="text-5.2">


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Bugs-&amp;-Fixes </h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6.1" class="outline-3">
<h3 id="sec-6.1"><span class="section-number-3">6.1</span> 1 </h3>
<div class="outline-text-3" id="text-6.1">

<p>COMMAND: avrdude -F -V -c arduino -p ATMEGA328P -P /dev/ttyACM0 -b 115200 -U flash:w:blink<sub>led</sub>.hex
</p>
<p>
ERROR:
avrdude: ser<sub>open</sub>(): can't open device "/dev/ttyACM0": Permission denied
ioctl("TIOCMGET"): Invalid argument
</p>
<p>
ANSWER:
Run avrdude as sudo!
</p>
</div>

</div>

<div id="outline-container-6.2" class="outline-3">
<h3 id="sec-6.2"><span class="section-number-3">6.2</span> 2 </h3>
<div class="outline-text-3" id="text-6.2">


</div>

<div id="outline-container-6.2.1" class="outline-4">
<h4 id="sec-6.2.1"><span class="section-number-4">6.2.1</span> ERROR: warning: #warning "F<sub>CPU</sub> not defined for &lt;util/delay.h&gt;" [-Wcpp] </h4>
<div class="outline-text-4" id="text-6.2.1">

<p>Error comes from an undefined preprocessor statement in the FILE.c
Chris's tutorial puts this define in the compilation pipeline itself
But when using a makefile that didn't fix the problem. I don't know why.
</p>
<p>
As a note, &lt;util/delay.h&gt; will use some defualt to define this but on the
chromebook this resulted in a super fast blinking LED that burned out after
30 seconds or so.  !!!!BE WARNED
<a href="http://www.avrfreaks.net/index.php?name=PNphpBB2&amp;file=printview&amp;t=126600&amp;start=0">http://www.avrfreaks.net/index.php?name=PNphpBB2&amp;file=printview&amp;t=126600&amp;start=0</a>
</p>
</div>

</div>

<div id="outline-container-6.2.2" class="outline-4">
<h4 id="sec-6.2.2"><span class="section-number-4">6.2.2</span> FIX:  put the define in FILE.c itself. </h4>
<div class="outline-text-4" id="text-6.2.2">

<p>This allows the compilation with the makefile without a warning 
"#define F<sub>CPU</sub> 16000000UL" 
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> c-arduino basics </h2>
<div class="outline-text-2" id="text-7">


<p>
chaos@chaos ~/Dev/Arduino/267-proj $  avr-gcc -mmcu=atmega328p blink<sub>led</sub>.o -o blink<sub>led</sub>
chaos@chaos ~/Dev/Arduino/267-proj $  avr-objcopy -O ihex -R .eeprom blink<sub>led</sub> blink<sub>led</sub>.hex
chaos@chaos ~/Dev/Arduino/267-proj $ avrdude -F -V -c arduino -p ATMEGA328P -P /dev/ttyACM0 -b 115200 -U flash:w:blink<sub>led</sub>.hex
</p>
<p>
avrdude: AVR device initialized and ready to accept instructions
</p>
<p>
Reading | ################################################## | 100% 0.00s
</p>
<p>
avrdude: Device signature = 0x1e950f
avrdude: NOTE: FLASH memory has been specified, an erase cycle will be performed
To disable this feature, specify the -D option.
avrdude: erasing chip
avrdude: reading input file "blink<sub>led</sub>.hex"
avrdude: input file blink<sub>led</sub>.hex auto detected as Intel Hex
avrdude: writing flash (202 bytes):
</p>
<p>
Writing | ################################################## | 100% 0.04s
</p>
<p>
avrdude: 202 bytes of flash written
</p>
<p>
avrdude: safemode: Fuses OK
</p>
<p>
avrdude done.  Thank you.
</p>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Tool-Chain </h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8.1" class="outline-3">
<h3 id="sec-8.1"><span class="section-number-3">8.1</span> sudo apt-get install make avr-libc avrdude binutils-avr gcc-avr gdb-avr </h3>
<div class="outline-text-3" id="text-8.1">

</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Tutorials </h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9.1" class="outline-3">
<h3 id="sec-9.1"><span class="section-number-3">9.1</span> German robot course </h3>
<div class="outline-text-3" id="text-9.1">

<p>svn checkout <a href="http://ornella.iwr.uni-heidelberg.de/svn/basis">http://ornella.iwr.uni-heidelberg.de/svn/basis</a>
</p></div>

</div>

<div id="outline-container-9.2" class="outline-3">
<h3 id="sec-9.2"><span class="section-number-3">9.2</span> Amercan<sub>Tutorials</sub> </h3>
<div class="outline-text-3" id="text-9.2">


</div>

<div id="outline-container-9.2.1" class="outline-4">
<h4 id="sec-9.2.1"><span class="section-number-4">9.2.1</span> Chris Kuethe--<a href="https://www.mainframe.cx/~ckuethe/avr-c-tutorial/">https://www.mainframe.cx/~ckuethe/avr-c-tutorial/</a> </h4>
<div class="outline-text-4" id="text-9.2.1">

<p><a href="https://www.mainframe.cx/~ckuethe/avr-c-tutorial/pin_map.html">https://www.mainframe.cx/~ckuethe/avr-c-tutorial/pin_map.html</a>
</p>

<p>
<a href="http://canthack.org/2010/12/programming-the-arduino-in-pure-c/">http://canthack.org/2010/12/programming-the-arduino-in-pure-c/</a>
<a href="http://balau82.wordpress.com/2011/03/29/programming-arduino-uno-in-pure-c/">http://balau82.wordpress.com/2011/03/29/programming-arduino-uno-in-pure-c/</a>
AVR C <a href="https://www.mainframe.cx/~ckuethe/avr-c-tutorial/">https://www.mainframe.cx/~ckuethe/avr-c-tutorial/</a>  
<a href="http://www.mjoldfield.com/atelier/2009/02/arduino-cli.html">http://www.mjoldfield.com/atelier/2009/02/arduino-cli.html</a>
<a href="http://johanneshoff.com/arduino-command-line.htm">http://johanneshoff.com/arduino-command-line.htm</a>
<a href="http://kartikmohta.com/tech/avr/tutorial/">http://kartikmohta.com/tech/avr/tutorial/</a>
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Arduino-Uno </h2>
<div class="outline-text-2" id="text-10">

<p><a href="http://arduino.cc/en/uploads/Main/arduino-uno-schematic.pd">http://arduino.cc/en/uploads/Main/arduino-uno-schematic.pd</a>
</p></div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> AVR-info </h2>
<div class="outline-text-2" id="text-11">

<p><a href="http://download-mirror.savannah.gnu.org/releases//avrdude/avrdude-doc-5.10.pdf">http://download-mirror.savannah.gnu.org/releases//avrdude/avrdude-doc-5.10.pdf</a>
</p></div>

</div>
