WRITE_UPS/README.html

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Links </h2>
<div class="outline-text-2" id="text-12">

<p><a href="http://code.google.com/p/tinkerit/wiki/Cantarino">http://code.google.com/p/tinkerit/wiki/Cantarino</a>
<a href="http://forum.arduino.cc/index.php?topic=49654.0">http://forum.arduino.cc/index.php?topic=49654.0</a>
<a href="http://forum.arduino.cc/index.php/topic,136758.0.html">http://forum.arduino.cc/index.php/topic,136758.0.html</a>
<a href="http://letsmakerobots.com/node/33388">http://letsmakerobots.com/node/33388</a>
</p>

<p>
XXXX
Clive Webster (Webbot)
<a href="http://www.societyofrobots.com/member_tutorials/node/211">http://www.societyofrobots.com/member_tutorials/node/211</a>
</p>
<p>
<a href="http://www.speechchips.com/shop/">http://www.speechchips.com/shop/</a>
<a href="http://www.speechchips.com/shop/item.aspx?itemid=22">http://www.speechchips.com/shop/item.aspx?itemid=22</a>
<a href="http://www.speechchips.com/shop/category.aspx?catid=3">http://www.speechchips.com/shop/category.aspx?catid=3</a>
</p>
<p>
XX?
<a href="http://brittonkerin.com/cduino/">http://brittonkerin.com/cduino/</a>
</p></div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> AtmEGA328-datasheet++ </h2>
<div class="outline-text-2" id="text-13">


</div>

<div id="outline-container-13.1" class="outline-3">
<h3 id="sec-13.1"><span class="section-number-3">13.1</span> Pins &amp; Ports </h3>
<div class="outline-text-3" id="text-13.1">

<p>Pin TOTAL= 28 PDIP style
</p>
</div>

<div id="outline-container-13.1.1" class="outline-4">
<h4 id="sec-13.1.1"><span class="section-number-4">13.1.1</span> Ports </h4>
<div class="outline-text-4" id="text-13.1.1">

<p>VCC - digital supply voltage
GND - ground
PortB - (PB7:0) XTAL1/XTAL2/TOSC1/TOSC2
PortC - (PC5:0)
PC6/RESET
PortD - (PD7:0)
AVcc - AVCC is the supply voltage pin for the A/D Converter, PC3:0, and ADC7:6 
AREF is the analog reference pin for the A/D Converter.
ADC7:6(TQFP and QFN/MLF package only) ?? what the fuck does that mean?
</p>
</div>
</div>

</div>

<div id="outline-container-13.2" class="outline-3">
<h3 id="sec-13.2"><span class="section-number-3">13.2</span> Qtouch capacitive touch sensing </h3>
<div class="outline-text-3" id="text-13.2">

<p>Atmel® offers the QTouch® library for embedding capacitive touch buttons, sliders and wheels functionality into
AVR® microcontrollers. The patented charge-transfer signal acquisition offers robust sensing and includes fully
debounced reporting of touch keys and includes Adjacent Key Suppression® (AKSTM) technology for unambiguous
detection of key events. The easy-to-use QTouch Suite toolchain allows you to explore, develop and debug your
own touch applications.
</p>
</div>

</div>

<div id="outline-container-13.3" class="outline-3">
<h3 id="sec-13.3"><span class="section-number-3">13.3</span> Program on the fly SPI </h3>
<div class="outline-text-3" id="text-13.3">

<p>The device is manufactured using Atmel’s high density non-volatile memory technology. The On-chip ISP Flash
allows the program memory to be reprogrammed In-System through an SPI serial interface, by a conventional non-
volatile memory programmer, or by an On-chip Boot program running on the AVR core. The Boot program can use
any interface to download the application program in the Application Flash memory. Software in the Boot Flash
section will continue to run while the Application Flash section is updated, providing true Read-While-Write opera-
tion. By combining an 8-bit RISC CPU with In-System Self-Programmable Flash on a monolithic chip, the Atmel
ATmega48A/PA/88A/PA/168A/PA/328/P is a powerful microcontroller that provides a highly flexible and cost effec-
tive solution to many embedded control applications.
</p>

<p>
<a href="http://www.atmel.com/images/doc8453.pdf">http://www.atmel.com/images/doc8453.pdf</a>
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: n-critser
<a href="mailto:nc_chaos@localhost">&lt;nc_chaos@localhost&gt;</a>
</p>
<p class="date"> Date: 2014-02-04</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
