WRITE_UPS/README.txt
[http://code.google.com/p/tinkerit/wiki/Cantarino]
[http://forum.arduino.cc/index.php?topic=49654.0]
[http://forum.arduino.cc/index.php/topic,136758.0.html]
[http://letsmakerobots.com/node/33388]


XXXX
Clive Webster (Webbot)
[http://www.societyofrobots.com/member\_tutorials/node/211]

[http://www.speechchips.com/shop/]
[http://www.speechchips.com/shop/item.aspx?itemid=22]
[http://www.speechchips.com/shop/category.aspx?catid=3]

XX?
[http://brittonkerin.com/cduino/]

[http://www.societyofrobots.com/member\_tutorials/node/211]: http://www.societyofrobots.com/member_tutorials/node/211

13 AtmEGA328-datasheet++ 
~~~~~~~~~~~~~~~~~~~~~~~~~

13.1 Pins & Ports 
==================
Pin TOTAL= 28 PDIP style

13.1.1 Ports 
-------------
VCC - digital supply voltage
GND - ground
PortB - (PB7:0) XTAL1/XTAL2/TOSC1/TOSC2
PortC - (PC5:0)
PC6/RESET
PortD - (PD7:0)
AVcc - AVCC is the supply voltage pin for the A/D Converter, PC3:0, and ADC7:6 
AREF is the analog reference pin for the A/D Converter.
ADC7:6(TQFP and QFN/MLF package only) ?? what the fuck does that mean?

13.2 Qtouch capacitive touch sensing 
=====================================
Atmel® offers the QTouch® library for embedding capacitive touch buttons, sliders and wheels functionality into
AVR® microcontrollers. The patented charge-transfer signal acquisition offers robust sensing and includes fully
debounced reporting of touch keys and includes Adjacent Key Suppression® (AKSTM) technology for unambiguous
detection of key events. The easy-to-use QTouch Suite toolchain allows you to explore, develop and debug your
own touch applications.

13.3 Program on the fly SPI 
============================
The device is manufactured using Atmel’s high density non-volatile memory technology. The On-chip ISP Flash
allows the program memory to be reprogrammed In-System through an SPI serial interface, by a conventional non-
volatile memory programmer, or by an On-chip Boot program running on the AVR core. The Boot program can use
any interface to download the application program in the Application Flash memory. Software in the Boot Flash
section will continue to run while the Application Flash section is updated, providing true Read-While-Write opera-
tion. By combining an 8-bit RISC CPU with In-System Self-Programmable Flash on a monolithic chip, the Atmel
ATmega48A/PA/88A/PA/168A/PA/328/P is a powerful microcontroller that provides a highly flexible and cost effec-
tive solution to many embedded control applications.


[http://www.atmel.com/images/doc8453.pdf]
